"""
На вход вашей программе передается последовательность натуральных чисел -- результаты измерений.
Каждое новое число передается с новой строки. Гарантируется, что длина входной последовательности
не меньше 6 и не превосходит 10 9 . На конце последовательности передается число 0.

Программа должна вывести на экран одно число -- максимальное значение входной последовательности
за исключением последних 5 элементов.
"""

a = int(input())
cache = [0]*6
max = 0
count = 0
while a != 0:
    cache = cache[1:6] + [a]
    if count == 0:
        max = a
    if cache[0] > max and count > 4:
        max = cache[0]
    count += 1
    a = int(input())
print(max)
