""" Напротив Васиного дома поставили забор, состоящий из 10 9 дощечек. Каждый день, выгдядывая в окно,
он видел, что часть забора с дощечки l i до дощечки r i красят в цвет c i . При этом он записывал,
какой отрезок забора в какой цвет красили. Эти данные он предоставил Вам и просил ответить на вопрос:
в какой цвет будут выкрашены интересующие Васю дощечки через N дней? Изначально все дощечки были цвета 0.

На первой строке вводится число 0 <= N <= 100 - количество дней. Далее на 3*N строках идут тройки чисел
(каждое в новой строке): 1 <= l i <= r i <= 10 9 и 0 <= c i <= 10 6 . Далее идет число 0 < M <= 100 -
число интересующих Васю дощечек. Далее на M строках номера дощечек.

Вывести M чисел, разделенных пробелами - цвета дощечек.

Примечание: не использовать массивы с длинами больше 101

Пример:
Ввод:
3
4
6
2
7
19
6
13
15
1
2
5
14
Вывод:
2 1

"""
days=[]
troika = [0] * 3

n = int(input())
for i in range(0, n*3):
    troika[i%3] = int(input())
    if i%3 == 2:
        days.append(troika[:])

answer = ""

m = int(input())
for i in range(0, m):
    board = int(input())
    for t in days[::-1]:
        if t[0] <= board <= t[1]:
            answer += str(t[2]) + " "
            break
    else:
        answer += str(0) + " "

print(answer)


