""" На острове Буяне жили N человек, каждый из которых был либо рыцарем либо лжецом, встали в круг.
Рыцари говорят только правду, лжецы всегда только лгут. Каждому человеку в кругу задали вопрос:
 «Кто ты и кто твой сосед слева: рыцарь или лжец?» При этом каждый человек сказал, что он – рыцарь.
А ответы всех людей о левом соседе были записаны в следующем формате: 1 – рыцарь 0 – лжец.
Все ответы записаны в строку через пробел. Последний спрошенный человек отвечал на вопрос о первом.
Написать программу, которая по ответам жителей определяет, какое количество рыцарей заведомо присутствует в круге.
Входные данные
Первое число ( 1 < N ≤ 255 ) - количество жителей. Следующие N чисел (0 или 1), разделенных пробелами - ответы жителей.
"""
n = int(input())
list = [0]*n
str = input().split(" ")
for i in range(0, n):
    list[i] = int(str[i])

i=0
count = 0
while i<n:
    if list[i] == 0 and list[i-1] == 0:
        count += 1
        i += 1
    elif list[i] == 0 and list[i-1] == 1:
        count += 1
        i += 1
    i += 1
print(count)