""" Студент покупает рис каждый день.
В первую неделю рис стоит price монет.
Каждый день (перед началом рабочего дня) цена риса увеличивается на delta монет (price = price + delta).
Неделя - 7 дней.
Студент покупал рис m недель.

Написать программу , которая вычисляет сколько денег потратил студент. """

str = input().split(" ")
price = int(str[0])
delta = int(str[1])
m = int(str[2])
sum = 0
for i in range (0, m*7):
    sum += price
    price += delta
print(sum)


