"""
Герою компьютерной игры нужно перебраться от одного края экрана к другому,
перепрыгивая по платформам. При этом при прыжке с одной платформы на соседнюю,
у героя уходит |y2-y1| единиц энергии, где y1 и y2 – высоты, на которых расположены
эти платформы. Кроме того, у героя есть суперприем, который позволяет перескочить
 через платформу, но на это затрачивается 3*|y3-y1| единиц энергии.
  Конечно же, энергию следует расходовать максимально экономно.

Вам известны высоты всех платформ в порядке от левого края до правого.
Необходимо найти, какое минимальное количество энергии потребуется герою,
чтобы добраться с первой платформы до последней.
"""

n = int(input())
a = [-1]*n
c = [0]*n
for i in range(0, n):
    a[i] = int(input())
    if i == 0:
        continue
    if i == 1:
        c[i] = c[i-1] + abs(a[i] - a[i-1])
        continue
    c[i] = min(abs(a[i] - a[i-1]) + c[i-1], abs((a[i] - a[i-2]) * 3) + c[i-2])
print(c[n-1])
