"""
 В Банановой республике очень много холмов, соединенных мостами.
На химическом заводе произошла авария, в результате чего испарилось
экспериментальное удобрение "зован". На следующий день выпал цветной
дождь, причем он прошел только над холмами. В некоторых местах падали
красные капли, в некоторых – синие, а в остальных – зеленые,
в результате чего холмы стали соответствующего цвета.
Президенту Банановой республики это понравилось, но ему захотелось
покрасить мосты между вершинами холмов так, чтобы мосты были
покрашены в цвет холмов, которые они соединяют. К сожалению, если
холмы разного цвета, то покрасить мост таким образом не удастся.
Посчитайте количество таких "плохих" мостов.

Формат входных данных

В первой строке входных данных содержится число N (0 < N ≤ 100)
– количество холмов. Далее идет матрица смежности, описывающая
наличие мостов между холмами (1 – мост есть, 0 – нет).
После матрицы смежности идёт пустая строка , и в последней строке
записано N чисел, обозначающих цвет холмов: 1 – красный; 2 – синий;
3 – зеленый.

Формат выходных данных

Выведите одно число – количество "плохих" мостов.
"""

"""Решил для разнообразия использовать список смежности"""
G = {}

n = int(input())

for i in range(n):
    G[i] = set()
    arr = list(map(int,input().split(" ")))
    for j in range(n):
        if arr[j] == 1:
            G[i].add(j)


input()
Color = list(map(int, input().split(" ")))
count = 0

for i in G:
    for j in G[i]:
        if Color[i] != Color[j]:
            count += 1

print(count//2)


