"""
 Ориентированный граф называется полуполным, если между любой парой
его различных вершин есть хотя бы одно ребро.
Для заданного списком ребер графа проверьте,
является ли он полуполным.

Формат входных данных
Сначала вводятся числа n ( 1 <= n <= 100) – количество вершин в графе
и m ( 1 <= m <= n(n - 1)) – количество ребер.
Затем следует m пар чисел – ребра графа.
Номера вершин начинаются с 0.

Формат выходных данных
Выведите «YES», если граф является полуполным,
и «NO» в противном случае.
"""

n, m = list(map(int, input().split(" ")))

G = [[0] * n for i in range(n)]


for i in range(m):
    r = list(map(int, input().split(" ")))
    G[r[0]][r[1]] = 1


def check(G):
    for i in range(n):
        for j in range(n):
            if i != j and G[i][j] < 1 and G[j][i] < 1:
                return False
    return True

print("YES" if check(G) else "NO")


